espressif/esp-idf/components/soc/esp32h4/register/soc/pmu_reg.h
/** PMU_CLK_STATE2_REG register
 *  need_des
 */
#define PMU_CLK_STATE2_REG (DR_REG_PMU_BASE + 0x1b4)
/** PMU_ICG_APB_EN_STATE : RO; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define PMU_ICG_APB_EN_STATE    0xFFFFFFFFU
#define PMU_ICG_APB_EN_STATE_M  (PMU_ICG_APB_EN_STATE_V << PMU_ICG_APB_EN_STATE_S)
#define PMU_ICG_APB_EN_STATE_V  0xFFFFFFFFU
#define PMU_ICG_APB_EN_STATE_S  0

/** PMU_DCM_CTRL_REG register
 *  need_des
 */
#define PMU_DCM_CTRL_REG (DR_REG_PMU_BASE + 0x1b8)
/** PMU_DSFMOS_USE_POR : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define PMU_DSFMOS_USE_POR    (BIT(0))
#define PMU_DSFMOS_USE_POR_M  (PMU_DSFMOS_USE_POR_V << PMU_DSFMOS_USE_POR_S)
#define PMU_DSFMOS_USE_POR_V  0x00000001U
#define PMU_DSFMOS_USE_POR_S  0
/** PMU_DCDC_DCM_UPDATE : WT; bitpos: [22]; default: 0;
 *  need_des
 */
#define PMU_DCDC_DCM_UPDATE    (BIT(22))
#define PMU_DCDC_DCM_UPDATE_M  (PMU_DCDC_DCM_UPDATE_V << PMU_DCDC_DCM_UPDATE_S)
#define PMU_DCDC_DCM_UPDATE_V  0x00000001U
#define PMU_DCDC_DCM_UPDATE_S  22
/** PMU_DCDC_PCUR_LIMIT : R/W; bitpos: [25:23]; default: 1;
 *  need_des
 */
#define PMU_DCDC_PCUR_LIMIT    0x00000007U
#define PMU_DCDC_PCUR_LIMIT_M  (PMU_DCDC_PCUR_LIMIT_V << PMU_DCDC_PCUR_LIMIT_S)
#define PMU_DCDC_PCUR_LIMIT_V  0x00000007U
#define PMU_DCDC_PCUR_LIMIT_S  23
/** PMU_DCDC_BIAS_CAL_DONE : RO; bitpos: [26]; default: 1;
 *  need_des
 */
#define PMU_DCDC_BIAS_CAL_DONE    (BIT(26))
#define PMU_DCDC_BIAS_CAL_DONE_M  (PMU_DCDC_BIAS_CAL_DONE_V << PMU_DCDC_BIAS_CAL_DONE_S)
#define PMU_DCDC_BIAS_CAL_DONE_V  0x00000001U
#define PMU_DCDC_BIAS_CAL_DONE_S  26
/** PMU_DCDC_CCM_SW_EN : R/W; bitpos: [27]; default: 0;
 *  need_des
 */
#define PMU_DCDC_CCM_SW_EN    (BIT(27))
#define PMU_DCDC_CCM_SW_EN_M  (PMU_DCDC_CCM_SW_EN_V << PMU_DCDC_CCM_SW_EN_S)
#define PMU_DCDC_CCM_SW_EN_V  0x00000001U
#define PMU_DCDC_CCM_SW_EN_S  27
/** PMU_DCDC_VCM_ENB : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_DCDC_VCM_ENB    (BIT(28))
#define PMU_DCDC_VCM_ENB_M  (PMU_DCDC_VCM_ENB_V << PMU_DCDC_VCM_ENB_S)
#define PMU_DCDC_VCM_ENB_V  0x00000001U
#define PMU_DCDC_VCM_ENB_S  28
/** PMU_DCDC_CCM_RDY : RO; bitpos: [29]; default: 0;
 *  need_des
 */
#define PMU_DCDC_CCM_RDY    (BIT(29))
#define PMU_DCDC_CCM_RDY_M  (PMU_DCDC_CCM_RDY_V << PMU_DCDC_CCM_RDY_S)
#define PMU_DCDC_CCM_RDY_V  0x00000001U
#define PMU_DCDC_CCM_RDY_S  29
/** PMU_DCDC_VCM_RDY : RO; bitpos: [30]; default: 1;
 *  need_des
 */
#define PMU_DCDC_VCM_RDY    (BIT(30))
#define PMU_DCDC_VCM_RDY_M  (PMU_DCDC_VCM_RDY_V << PMU_DCDC_VCM_RDY_S)
#define PMU_DCDC_VCM_RDY_V  0x00000001U
#define PMU_DCDC_VCM_RDY_S  30
/** PMU_DCDC_RDY_CLR : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_DCDC_RDY_CLR    (BIT(31))
#define PMU_DCDC_RDY_CLR_M  (PMU_DCDC_RDY_CLR_V << PMU_DCDC_RDY_CLR_S)
#define PMU_DCDC_RDY_CLR_V  0x00000001U
#define PMU_DCDC_RDY_CLR_S  31

/** PMU_DCM_BOOST_CTRL_REG register
 *  need_des
 */
#define PMU_DCM_BOOST_CTRL_REG (DR_REG_PMU_BASE + 0x1bc)
/** PMU_DCDC_BOOST_CCM_CTRLEN : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define PMU_DCDC_BOOST_CCM_CTRLEN    (BIT(24))
#define PMU_DCDC_BOOST_CCM_CTRLEN_M  (PMU_DCDC_BOOST_CCM_CTRLEN_V << PMU_DCDC_BOOST_CCM_CTRLEN_S)
#define PMU_DCDC_BOOST_CCM_CTRLEN_V  0x00000001U
#define PMU_DCDC_BOOST_CCM_CTRLEN_S  24
/** PMU_DCDC_BOOST_CCM_ENB : R/W; bitpos: [25]; default: 1;
 *  need_des
 */
#define PMU_DCDC_BOOST_CCM_ENB    (BIT(25))
#define PMU_DCDC_BOOST_CCM_ENB_M  (PMU_DCDC_BOOST_CCM_ENB_V << PMU_DCDC_BOOST_CCM_ENB_S)
#define PMU_DCDC_BOOST_CCM_ENB_V  0x00000001U
#define PMU_DCDC_BOOST_CCM_ENB_S  25
/** PMU_DCDC_BOOST_EN : R/W; bitpos: [26]; default: 0;
 *  need_des
 */
#define PMU_DCDC_BOOST_EN    (BIT(26))
#define PMU_DCDC_BOOST_EN_M  (PMU_DCDC_BOOST_EN_V << PMU_DCDC_BOOST_EN_S)
#define PMU_DCDC_BOOST_EN_V  0x00000001U
#define PMU_DCDC_BOOST_EN_S  26
/** PMU_DCDC_BOOST_DREG : R/W; bitpos: [31:27]; default: 23;
 *  need_des
 */
#define PMU_DCDC_BOOST_DREG    0x0000001FU
#define PMU_DCDC_BOOST_DREG_M  (PMU_DCDC_BOOST_DREG_V << PMU_DCDC_BOOST_DREG_S)
#define PMU_DCDC_BOOST_DREG_V  0x0000001FU
#define PMU_DCDC_BOOST_DREG_S  27

/** PMU_TOUCH_PWR_CTRL_REG register
 *  need_des
 */
#define PMU_TOUCH_PWR_CTRL_REG (DR_REG_PMU_BASE + 0x1c0)
/** PMU_TOUCH_SLEEP_CYCLES : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_CYCLES    0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_M  (PMU_TOUCH_SLEEP_CYCLES_V << PMU_TOUCH_SLEEP_CYCLES_S)
#define PMU_TOUCH_SLEEP_CYCLES_V  0x0000FFFFU
#define PMU_TOUCH_SLEEP_CYCLES_S  0
/** PMU_TOUCH_WAIT_CYCLES : R/W; bitpos: [29:21]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_WAIT_CYCLES    0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_M  (PMU_TOUCH_WAIT_CYCLES_V << PMU_TOUCH_WAIT_CYCLES_S)
#define PMU_TOUCH_WAIT_CYCLES_V  0x000001FFU
#define PMU_TOUCH_WAIT_CYCLES_S  21
/** PMU_TOUCH_SLEEP_TIMER_EN : R/W; bitpos: [30]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_SLEEP_TIMER_EN    (BIT(30))
#define PMU_TOUCH_SLEEP_TIMER_EN_M  (PMU_TOUCH_SLEEP_TIMER_EN_V << PMU_TOUCH_SLEEP_TIMER_EN_S)
#define PMU_TOUCH_SLEEP_TIMER_EN_V  0x00000001U
#define PMU_TOUCH_SLEEP_TIMER_EN_S  30
/** PMU_TOUCH_FORCE_DONE : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_TOUCH_FORCE_DONE    (BIT(31))
#define PMU_TOUCH_FORCE_DONE_M  (PMU_TOUCH_FORCE_DONE_V << PMU_TOUCH_FORCE_DONE_S)
#define PMU_TOUCH_FORCE_DONE_V  0x00000001U
#define PMU_TOUCH_FORCE_DONE_S  31

/** PMU_BLE_BANDGAP_CTRL_REG register
 *  need_des
 */
#define PMU_BLE_BANDGAP_CTRL_REG (DR_REG_PMU_BASE + 0x1c4)
/** PMU_EXT_OCODE : R/W; bitpos: [30:23]; default: 120;
 *  need_des
 */
#define PMU_EXT_OCODE    0x000000FFU
#define PMU_EXT_OCODE_M  (PMU_EXT_OCODE_V << PMU_EXT_OCODE_S)
#define PMU_EXT_OCODE_V  0x000000FFU
#define PMU_EXT_OCODE_S  23
/** PMU_EXT_FORCE_OCODE : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_EXT_FORCE_OCODE    (BIT(31))
#define PMU_EXT_FORCE_OCODE_M  (PMU_EXT_FORCE_OCODE_V << PMU_EXT_FORCE_OCODE_S)
#define PMU_EXT_FORCE_OCODE_V  0x00000001U
#define PMU_EXT_FORCE_OCODE_S  31

/** PMU_DATE_REG register
 *  need_des
 */
#define PMU_DATE_REG (DR_REG_PMU_BASE + 0x3fc)
/** PMU_PMU_DATE : R/W; bitpos: [30:0]; default: 38814336;
 *  need_des
 */
#define PMU_PMU_DATE    0x7FFFFFFFU
#define PMU_PMU_DATE_M  (PMU_PMU_DATE_V << PMU_PMU_DATE_S)
#define PMU_PMU_DATE_V  0x7FFFFFFFU
#define PMU_PMU_DATE_S  0
/** PMU_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define PMU_CLK_EN    (BIT(31))
#define PMU_CLK_EN_M  (PMU_CLK_EN_V << PMU_CLK_EN_S)
#define PMU_CLK_EN_V  0x00000001U
#define PMU_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
